# idleで入力

# 値を表示
print(100)

print(-123.45)

print(1234567890123456789012345)

# 足し算
print(1 + 1)

print(12.3 + 45.6)

print(1234567890123456789012345 + 12345)

#引き算
print(100 - 1)

#かけ算
print(2 * 2)

#わり算
print(100 / 2)
print(100 / 3)

#わり算の整数の答えと余り
print(100 // 3)
print(100 % 3)

#かっこ
print(1 + 2 * 3)
print((1 + 2) * 3)

#べき乗
print(100 ** 2)
print(2 ** 100)

# 文字を表示
print("Hello")
print("こんにちは")
print('私は"おはよう"と言った')

#複数の値を表示
print("10+20=",10+20)
print(2021-2001)
print("2021年、私は",2021-2001,"歳です。")

